window.QUIZ_DATA = [
  {
    "id": 1,
    "question": "(B)是中国共产党的根本政治立场，是马克思主义政党区别于其他政党的显著标志。",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "阶级立场"
      },
      {
        "key": "B",
        "text": "人民立场"
      },
      {
        "key": "C",
        "text": "政治立场"
      },
      {
        "key": "D",
        "text": "英雄立场"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）是中国共产党的根本政治立场，是马克思主义政党区别于其他政党的显著标志。"
  },
  {
    "id": 2,
    "question": "江山就是人民、人民就是江山，深刻揭示了(B)之间的辩证关系，闪耀着历史唯物主义的真理光芒。",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "人民与政党"
      },
      {
        "key": "B",
        "text": "人民与政权"
      },
      {
        "key": "C",
        "text": "人民与国家"
      },
      {
        "key": "D",
        "text": "人民与江山"
      }
    ],
    "type": "single",
    "displayQuestion": "江山就是人民、人民就是江山，深刻揭示了（ ）之间的辩证关系，闪耀着历史唯物主义的真理光芒。"
  },
  {
    "id": 3,
    "question": "(D)是中国特色社会主义的本质要求，也是一个长期的历史过程。",
    "answer": "D",
    "options": [
      {
        "key": "A",
        "text": "物质富足"
      },
      {
        "key": "B",
        "text": "精神富足"
      },
      {
        "key": "C",
        "text": "公平正义"
      },
      {
        "key": "D",
        "text": "共同富裕"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）是中国特色社会主义的本质要求，也是一个长期的历史过程。"
  },
  {
    "id": 4,
    "question": "(B)始终是党的生命线和根本工作路线，是我们党永葆青春活力和战斗力的重要传家宝。",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "政治路线"
      },
      {
        "key": "B",
        "text": "群众路线"
      },
      {
        "key": "C",
        "text": "组织路线"
      },
      {
        "key": "D",
        "text": "思想路线"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）始终是党的生命线和根本工作路线，是我们党永葆青春活力和战斗力的重要传家宝。"
  },
  {
    "id": 5,
    "question": "中国综合国力与日俱增，创造了(D)“两大奇迹”，人民生活水平不断提高，“风景这边独好”。",
    "answer": "D",
    "options": [
      {
        "key": "A",
        "text": "全面建成小康社会、实现全体人民共同富裕"
      },
      {
        "key": "B",
        "text": "党和国家事业兴旺发达、为人类作出新的更大的贡献"
      },
      {
        "key": "C",
        "text": "维护国家统一和民族团结、筑牢国家安全屏障"
      },
      {
        "key": "D",
        "text": "经济快速发展、社会长期稳定"
      }
    ],
    "type": "single",
    "displayQuestion": "中国综合国力与日俱增，创造了（ ）“两大奇迹”，人民生活水平不断提高，“风景这边独好”。"
  },
  {
    "id": 6,
    "question": "(A)是历史的创造者，是决定党和国家前途命运的根本力量。",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "人民"
      },
      {
        "key": "B",
        "text": "豪杰"
      },
      {
        "key": "C",
        "text": "英雄"
      },
      {
        "key": "D",
        "text": "领袖"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）是历史的创造者，是决定党和国家前途命运的根本力量。"
  },
  {
    "id": 7,
    "question": "改革开放和社会主义现代化建设新时期，党面临的主要任务是，继续探索中国建设社会主义的正确道路，解放和发展社会生产力，使人民摆脱贫困、尽快富裕起来，为实现中华民族伟大复兴提供 (A)。",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "充满新的活力的体制保证和快速发展的物质条件"
      },
      {
        "key": "B",
        "text": "根本社会条件"
      },
      {
        "key": "C",
        "text": "更为完善的制度保证、更为坚实的物质基础、更为主动的精神力量"
      },
      {
        "key": "D",
        "text": "根本政治前提和制度基础"
      }
    ],
    "type": "single",
    "displayQuestion": "改革开放和社会主义现代化建设新时期，党面临的主要任务是，继续探索中国建设社会主义的正确道路，解放和发展社会生产力，使人民摆脱贫困、尽快富裕起来，为实现中华民族伟大复兴提供 （ ）。"
  },
  {
    "id": 8,
    "question": "中国共产党摆脱了以往一切政治力量追求自身特殊利益的局限，一经诞生就把(C)确立为自己的初心使命",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "以百姓心为心，与人民同呼吸、共命运、心连心"
      },
      {
        "key": "B",
        "text": "始终同人民在一起，为人民利益而奋斗"
      },
      {
        "key": "C",
        "text": "为中国人民谋幸福，为中华民族谋复兴"
      },
      {
        "key": "D",
        "text": "带领人民攻坚克难，全心全意为人民服务"
      }
    ],
    "type": "single",
    "displayQuestion": "中国共产党摆脱了以往一切政治力量追求自身特殊利益的局限，一经诞生就把（ ）确立为自己的初心使命"
  },
  {
    "id": 9,
    "question": "中国式现代化是社会主义现代化、是独具特色、有别于资本主义的现代化。它破解了人类社会发展的诸多难题，摒弃了西方 (ABCD)。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "物质主义膨胀的现代化"
      },
      {
        "key": "B",
        "text": "对外扩张掠夺的现代化"
      },
      {
        "key": "C",
        "text": "两极分化的现代化"
      },
      {
        "key": "D",
        "text": "以资本为中心的现代化"
      }
    ],
    "type": "multiple",
    "displayQuestion": "中国式现代化是社会主义现代化、是独具特色、有别于资本主义的现代化。它破解了人类社会发展的诸多难题，摒弃了西方 （ ）。"
  },
  {
    "id": 10,
    "question": "中国产生了共产党，这是开天辟地的大事变，深刻改变了(ABD)。",
    "answer": "ABD",
    "options": [
      {
        "key": "A",
        "text": "中国人民和中华民族的前途和命运"
      },
      {
        "key": "B",
        "text": "近代以后中华民族发展的方向和进程"
      },
      {
        "key": "C",
        "text": "人类文明发展的方向和进程"
      },
      {
        "key": "D",
        "text": "世界发展的趋势和格局"
      }
    ],
    "type": "multiple",
    "displayQuestion": "中国产生了共产党，这是开天辟地的大事变，深刻改变了（ ）。"
  },
  {
    "id": 11,
    "question": "中国共产觉一经诞生，就把为中国人民谋幸福、为中华民族谋复兴确立为自己的初心使命。一百年来，中国共产党国结带领中国人民进行的一切奋斗、一切牺性、一切创造，归结起来就是一个主题(A)。",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "实现中华民族伟大复兴"
      },
      {
        "key": "B",
        "text": "实现中国梦"
      },
      {
        "key": "C",
        "text": "为中国人民谋幸福"
      },
      {
        "key": "D",
        "text": "为中华民族谋复兴"
      }
    ],
    "type": "single",
    "displayQuestion": "中国共产觉一经诞生，就把为中国人民谋幸福、为中华民族谋复兴确立为自己的初心使命。一百年来，中国共产党国结带领中国人民进行的一切奋斗、一切牺性、一切创造，归结起来就是一个主题（ ）。"
  },
  {
    "id": 12,
    "question": "实现中华民族伟大复兴，就是中华民族近代以来最伟大的梦想。下列选项不属于\"中国梦”的本质的是(B)",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "国家富强"
      },
      {
        "key": "B",
        "text": "社会和谐"
      },
      {
        "key": "C",
        "text": "民族振兴"
      },
      {
        "key": "D",
        "text": "人民幸福"
      }
    ],
    "type": "single",
    "displayQuestion": "实现中华民族伟大复兴，就是中华民族近代以来最伟大的梦想。下列选项不属于\"中国梦”的本质的是（ ）"
  },
  {
    "id": 13,
    "question": "不论过去、现在和将来，我们都更坚持(ABCD)，把党的正确主张变为群众的自觉行动。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "到群众中去"
      },
      {
        "key": "B",
        "text": "从群众中来"
      },
      {
        "key": "C",
        "text": "一切为了群众"
      },
      {
        "key": "D",
        "text": "一切依靠群众"
      }
    ],
    "type": "multiple",
    "displayQuestion": "不论过去、现在和将来，我们都更坚持（ ），把党的正确主张变为群众的自觉行动。"
  },
  {
    "id": 14,
    "question": "进入新时代，人民美好生活需要日益广泛，不仅对物质文化生活提出了更高要求，而且在(ABC)等方面的要求日益增长。",
    "answer": "ABC",
    "options": [
      {
        "key": "A",
        "text": "民主、法治"
      },
      {
        "key": "B",
        "text": "安全、环境"
      },
      {
        "key": "C",
        "text": "公平、正义"
      },
      {
        "key": "D",
        "text": "就业、教育"
      }
    ],
    "type": "multiple",
    "displayQuestion": "进入新时代，人民美好生活需要日益广泛，不仅对物质文化生活提出了更高要求，而且在（ ）等方面的要求日益增长。"
  },
  {
    "id": 15,
    "question": "全面建成小康社会，是“两个一百年”奋斗目标的第一个百年奋斗目标，是我们党向人民、向历史作出的庄严承诺。全面小康是 (ABD)。",
    "answer": "ABD",
    "options": [
      {
        "key": "A",
        "text": "城乡区域共同发展的小康"
      },
      {
        "key": "B",
        "text": "惠及全体人民的小康"
      },
      {
        "key": "C",
        "text": "全体人民同步富裕的小康"
      },
      {
        "key": "D",
        "text": "是“五位一体”全面进步的小康"
      }
    ],
    "type": "multiple",
    "displayQuestion": "全面建成小康社会，是“两个一百年”奋斗目标的第一个百年奋斗目标，是我们党向人民、向历史作出的庄严承诺。全面小康是 （ ）。"
  },
  {
    "id": 16,
    "question": "中国式现代化是社会主义现代化、是独具特色、有别于资本主义的现代化。它破解了人类社会发展的诸多难题，摒弃了西方 (ABCD)。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "物质主义膨胀的现代化"
      },
      {
        "key": "B",
        "text": "对外扩张掠夺的现代化"
      },
      {
        "key": "C",
        "text": "两极分化的现代化"
      },
      {
        "key": "D",
        "text": "以资本为中心的现代化"
      }
    ],
    "type": "multiple",
    "displayQuestion": "中国式现代化是社会主义现代化、是独具特色、有别于资本主义的现代化。它破解了人类社会发展的诸多难题，摒弃了西方 （ ）。"
  },
  {
    "id": 17,
    "question": "在新中国成立特别是改革开放以来的长期探索和实践基础上，经过党的十八大以来在理论和实践上的创新突破，我们成功推进和拓展了中国式现代化。中国式现代化(BCD)。",
    "answer": "BCD",
    "options": [
      {
        "key": "A",
        "text": "是工业化、信息化、城镇化、农业现代化“串联式”的发展过程"
      },
      {
        "key": "B",
        "text": "既有各国现代化的共同特征，更有基于自己国情的中国特色"
      },
      {
        "key": "C",
        "text": "拓展了发展中国家走向现代化的途径"
      },
      {
        "key": "D",
        "text": "克服了资本主义现代化所固有的先天性弊端"
      }
    ],
    "type": "multiple",
    "displayQuestion": "在新中国成立特别是改革开放以来的长期探索和实践基础上，经过党的十八大以来在理论和实践上的创新突破，我们成功推进和拓展了中国式现代化。中国式现代化（ ）。"
  },
  {
    "id": 18,
    "question": "全面建成小康社会，创造了能彪炳史册的人间奇迹。意味着（ABD）",
    "answer": "ABD",
    "options": [
      {
        "key": "A",
        "text": "表明我国发展和人民生活水平跃上新的大台阶"
      },
      {
        "key": "B",
        "text": "中华民族实现了数千年来的夙愿"
      },
      {
        "key": "C",
        "text": "全体人民实现了共同富裕"
      },
      {
        "key": "D",
        "text": "是实现中华民族伟大复兴征程中的关键一步"
      }
    ],
    "type": "multiple",
    "displayQuestion": "全面建成小康社会，创造了能彪炳史册的人间奇迹。意味着（ ）"
  },
  {
    "id": 19,
    "question": "我们正在向第二个百年奋斗目标迈进，适应我国社会主要矛盾的变化，更好满足人民日益增长的美好生活需要，必须把促进全体人民共同富裕作为为人民谋幸福的着力点，不断夯实党长期执政基础。关于共同富裕，说法正确的有(ABD)。",
    "answer": "ABD",
    "options": [
      {
        "key": "A",
        "text": "共同富裕是全体人民的富裕，是人民群众物质生活和精神生活都富裕"
      },
      {
        "key": "B",
        "text": "全体人民共同富裕是一个总体概念，是对全社会而言的"
      },
      {
        "key": "C",
        "text": "要增强区域发展的平衡性，确保所有地区同时达到一个富裕水准"
      },
      {
        "key": "D",
        "text": "共同富裕是一个在动态中向前发展的过程要持续推动，不断取得成效"
      }
    ],
    "type": "multiple",
    "displayQuestion": "我们正在向第二个百年奋斗目标迈进，适应我国社会主要矛盾的变化，更好满足人民日益增长的美好生活需要，必须把促进全体人民共同富裕作为为人民谋幸福的着力点，不断夯实党长期执政基础。关于共同富裕，说法正确的有（ ）。"
  },
  {
    "id": 20,
    "question": "“以民为本，吾党所向”。民族复兴，首年担当。摆脱装困、全面小康。惠此中华，以利四方。中国共产党历史展览馆里的“小康宝鼎”上的32字铭文记录着\"第一个首年奋斗目标的成功实现。全面建成小康社会(ABCD)",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "实现了”两个一百年”奋斗目标的第一个百年奋斗目标"
      },
      {
        "key": "B",
        "text": "历史性地解决了绝对贫困问题"
      },
      {
        "key": "C",
        "text": "是党向人民、向历史作出的庄严承诺，是中国人民的共同期盼"
      },
      {
        "key": "D",
        "text": "是实现中华民族伟大复兴的关键一步"
      }
    ],
    "type": "multiple",
    "displayQuestion": "“以民为本，吾党所向”。民族复兴，首年担当。摆脱装困、全面小康。惠此中华，以利四方。中国共产党历史展览馆里的“小康宝鼎”上的32字铭文记录着\"第一个首年奋斗目标的成功实现。全面建成小康社会（ ）"
  },
  {
    "id": 21,
    "question": "(C)是更基础、更广泛、更深厚的自信,是一个国家、一个民族发展中最基本、最深沉、最持久的力量。",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "道路自信"
      },
      {
        "key": "B",
        "text": "制度自信"
      },
      {
        "key": "C",
        "text": "文化自信"
      },
      {
        "key": "D",
        "text": "理论自信"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）是更基础、更广泛、更深厚的自信,是一个国家、一个民族发展中最基本、最深沉、最持久的力量。"
  },
  {
    "id": 22,
    "question": "全面推进依法治国涉及很多方面，在实际工作中必须有个总揽全局、牵引各方的总抓手，这个总抓手是 。 (A)",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "建设中国特色社会主义法治体系"
      },
      {
        "key": "B",
        "text": "建设中国特色社会主义法律体系"
      },
      {
        "key": "C",
        "text": "建设中国特色社会主义制度体系"
      },
      {
        "key": "D",
        "text": "建设中国特色社会主义监督体系"
      }
    ],
    "type": "single",
    "displayQuestion": "全面推进依法治国涉及很多方面，在实际工作中必须有个总揽全局、牵引各方的总抓手，这个总抓手是 。 （ ）"
  },
  {
    "id": 23,
    "question": "(B)的力量，或者我们称之为构成综合竟争力的文化软实力，总是”润物细无声”地融入经济力量、政治力量、社会力量之中，成为经济发展的“助推器”、政治文明的“导航灯”、社会和谐的“黏合剂”。",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "道德"
      },
      {
        "key": "B",
        "text": "文化"
      },
      {
        "key": "C",
        "text": "思想"
      },
      {
        "key": "D",
        "text": "文明"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）的力量，或者我们称之为构成综合竟争力的文化软实力，总是”润物细无声”地融入经济力量、政治力量、社会力量之中，成为经济发展的“助推器”、政治文明的“导航灯”、社会和谐的“黏合剂”。"
  },
  {
    "id": 24,
    "question": "(B)是坚持和发展中国特色社会主义的本质要求和重要保障，是实现国家治理体系和治理能力现代化的必然要求。",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "改革开放"
      },
      {
        "key": "B",
        "text": "依法治国"
      },
      {
        "key": "C",
        "text": "依法执政"
      },
      {
        "key": "D",
        "text": "依法行政"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）是坚持和发展中国特色社会主义的本质要求和重要保障，是实现国家治理体系和治理能力现代化的必然要求。"
  },
  {
    "id": 25,
    "question": "党的十八届四中全会提出，法治的生命线是(C)。",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "平等"
      },
      {
        "key": "B",
        "text": "民主"
      },
      {
        "key": "C",
        "text": "公正"
      },
      {
        "key": "D",
        "text": "公平"
      }
    ],
    "type": "single",
    "displayQuestion": "党的十八届四中全会提出，法治的生命线是（ ）。"
  },
  {
    "id": 26,
    "question": "党的十八大以来，以习近平同志为核心的党中央着力解决意识形态领域党的领导弱化问题，立破并举、激浊扬清，就意识形态领域方向性、战略性问题作出部署，确立和坚持(C)在意识形态领域指导地位的根本制度。",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "社会重义先进文化"
      },
      {
        "key": "B",
        "text": "社会主义核心价值观"
      },
      {
        "key": "C",
        "text": "马克思主义"
      },
      {
        "key": "D",
        "text": "习近平新时代中国特色社会主义思想"
      }
    ],
    "type": "single",
    "displayQuestion": "党的十八大以来，以习近平同志为核心的党中央着力解决意识形态领域党的领导弱化问题，立破并举、激浊扬清，就意识形态领域方向性、战略性问题作出部署，确立和坚持（ ）在意识形态领域指导地位的根本制度。"
  },
  {
    "id": 27,
    "question": "习近平在主持中共十九届中央政治局第十二次集体学习时的讲话强调:“没有(B)就没有国家安全:过不了互联网这一关,就过不了长期执政这一关。",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "社会安全"
      },
      {
        "key": "B",
        "text": "网络安全"
      },
      {
        "key": "C",
        "text": "文化安全"
      }
    ],
    "type": "single",
    "displayQuestion": "习近平在主持中共十九届中央政治局第十二次集体学习时的讲话强调:“没有（ ）就没有国家安全:过不了互联网这一关,就过不了长期执政这一关。"
  },
  {
    "id": 28,
    "question": "社会主义核心价值观是凝聚人心、汇聚民力的强大力量。其中，(C)是社会主义核心价值观建设的根本问题",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "建设什么样的国家"
      },
      {
        "key": "B",
        "text": "建设什么样的社会"
      },
      {
        "key": "C",
        "text": "培育什么样的公民"
      },
      {
        "key": "D",
        "text": "发展什么样的文化"
      }
    ],
    "type": "single",
    "displayQuestion": "社会主义核心价值观是凝聚人心、汇聚民力的强大力量。其中，（ ）是社会主义核心价值观建设的根本问题"
  },
  {
    "id": 29,
    "question": "宪法 (ABCD)，在国家和社会生活中具有总括性、原则性、纲领性、方向性。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "具有最高的法律地位、法律权威、法律效力"
      },
      {
        "key": "B",
        "text": "是国家各种制度和法律法规的总依据"
      },
      {
        "key": "C",
        "text": "是国家根本法"
      },
      {
        "key": "D",
        "text": "是党和人民意志的集中体现"
      }
    ],
    "type": "multiple",
    "displayQuestion": "宪法 （ ），在国家和社会生活中具有总括性、原则性、纲领性、方向性。"
  },
  {
    "id": 30,
    "question": "什么共同构建了新时代中国特色社会主义文化的基本内容？(ABC)",
    "answer": "ABC",
    "options": [
      {
        "key": "A",
        "text": "中华优秀传统文化"
      },
      {
        "key": "B",
        "text": "革命文化"
      },
      {
        "key": "C",
        "text": "社会主义先进文化"
      },
      {
        "key": "D",
        "text": "马克思主义"
      }
    ],
    "type": "multiple",
    "displayQuestion": "什么共同构建了新时代中国特色社会主义文化的基本内容？（ ）"
  },
  {
    "id": 31,
    "question": "全面依法治国最广泛、最深厚的基础是 (C)。",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "司法队伍"
      },
      {
        "key": "B",
        "text": "立法队伍"
      },
      {
        "key": "C",
        "text": "人民"
      },
      {
        "key": "D",
        "text": "行政执法队伍"
      }
    ],
    "type": "single",
    "displayQuestion": "全面依法治国最广泛、最深厚的基础是 （ ）。"
  },
  {
    "id": 32,
    "question": "党的领导、人民当家作主、依法治国三者有机结和统一于中国特色社会主义民主政治伟大实践。其中(A)是党领导人民治理国家的基本方式。",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "依法治国"
      },
      {
        "key": "B",
        "text": "党的领导日"
      },
      {
        "key": "C",
        "text": "人民当家作主"
      },
      {
        "key": "D",
        "text": "全过程人民民主"
      }
    ],
    "type": "single",
    "displayQuestion": "党的领导、人民当家作主、依法治国三者有机结和统一于中国特色社会主义民主政治伟大实践。其中（ ）是党领导人民治理国家的基本方式。"
  },
  {
    "id": 33,
    "question": "全面推进依法治国是，解决党和国家事业发展面临的一系列重大问题，(ABCD)的根本要求。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "解放和增强社会活力"
      },
      {
        "key": "B",
        "text": "维护社会和谐稳定"
      },
      {
        "key": "C",
        "text": "确保党和国家长治久安"
      },
      {
        "key": "D",
        "text": "促进社会公平正义"
      }
    ],
    "type": "multiple",
    "displayQuestion": "全面推进依法治国是，解决党和国家事业发展面临的一系列重大问题，（ ）的根本要求。"
  },
  {
    "id": 34,
    "question": "习近平法治思想为全面依法治国指明了正确的方向其最直观的表述体现为\"三个坚持\"，即(ABC)。",
    "answer": "ABC",
    "options": [
      {
        "key": "A",
        "text": "坚持以人民为中心"
      },
      {
        "key": "B",
        "text": "坚持中国特色社会主义法治道路"
      },
      {
        "key": "C",
        "text": "坚持党对全面依法治国的领导"
      },
      {
        "key": "D",
        "text": "坚持依宪执政"
      }
    ],
    "type": "multiple",
    "displayQuestion": "习近平法治思想为全面依法治国指明了正确的方向其最直观的表述体现为\"三个坚持\"，即（ ）。"
  },
  {
    "id": 35,
    "question": "马克思主义是(ABCD)。无论时代如何变迁。科学如何步、马克思主义依然显示出科学思想的伟力，依然据着真理和道义的制高点。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "实践的理论"
      },
      {
        "key": "B",
        "text": "人民的理论"
      },
      {
        "key": "C",
        "text": "不断发展的开放的理论"
      },
      {
        "key": "D",
        "text": "科学的理论"
      }
    ],
    "type": "multiple",
    "displayQuestion": "马克思主义是（ ）。无论时代如何变迁。科学如何步、马克思主义依然显示出科学思想的伟力，依然据着真理和道义的制高点。"
  },
  {
    "id": 36,
    "question": "加快形成高效的法治实施体系，要坚持(BCD)，切实维护法律尊严和权威，确保法律全面有效实施。",
    "answer": "BCD",
    "options": [
      {
        "key": "A",
        "text": "完备立法"
      },
      {
        "key": "B",
        "text": "公正司法"
      },
      {
        "key": "C",
        "text": "全民守法"
      },
      {
        "key": "D",
        "text": "严格执法"
      }
    ],
    "type": "multiple",
    "displayQuestion": "加快形成高效的法治实施体系，要坚持（ ），切实维护法律尊严和权威，确保法律全面有效实施。"
  },
  {
    "id": 37,
    "question": "宪法 (ABCD)，在国家和社会生活中具有总括性。原则性、纲领性、方向性。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "具有最高的法律地位、法律权威、法律效力"
      },
      {
        "key": "B",
        "text": "是国家各种制度和法律法规的总依据"
      },
      {
        "key": "C",
        "text": "是国家根本法"
      },
      {
        "key": "D",
        "text": "是党和人民意志的集中体现"
      }
    ],
    "type": "multiple",
    "displayQuestion": "宪法 （ ），在国家和社会生活中具有总括性。原则性、纲领性、方向性。"
  },
  {
    "id": 38,
    "question": "新时代坚持马克思主义在意识形态领域指导地位的根本制度是(ABCD)",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "恪守党的本质属性、巩固党的团结统一的必然要求"
      },
      {
        "key": "B",
        "text": "坚持正确发展道路、实现国家长治久安的必然要求"
      },
      {
        "key": "C",
        "text": "筑牢全体人民共同思想基础、凝聚团结奋进强大精神力量的必然要求"
      },
      {
        "key": "D",
        "text": "保证我国文化建设正确方向、更好担负起新时代使命任务的必然要求"
      }
    ],
    "type": "multiple",
    "displayQuestion": "新时代坚持马克思主义在意识形态领域指导地位的根本制度是（ ）"
  },
  {
    "id": 39,
    "question": "坚持全面推进(ABCD)，是全面依法治国的重要环节",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "严格执法"
      },
      {
        "key": "B",
        "text": "全民守法"
      },
      {
        "key": "C",
        "text": "公正司法"
      },
      {
        "key": "D",
        "text": "科学立法"
      }
    ],
    "type": "multiple",
    "displayQuestion": "坚持全面推进（ ），是全面依法治国的重要环节"
  },
  {
    "id": 40,
    "question": "中国特色社会主义文化最有理由、最有底气充满自信。自信从历史中来:自信从奋斗中来:自信从实践中来。收百世之阙文，采千载之遗韵。中华文明源远流长、博大精深，是(ABCD)",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "中华民族独特的精神标识"
      },
      {
        "key": "B",
        "text": "当代中国文化的根基"
      },
      {
        "key": "C",
        "text": "维系全世界华人的精神纽带"
      },
      {
        "key": "D",
        "text": "中国文化创新的宝藏"
      }
    ],
    "type": "multiple",
    "displayQuestion": "中国特色社会主义文化最有理由、最有底气充满自信。自信从历史中来:自信从奋斗中来:自信从实践中来。收百世之阙文，采千载之遗韵。中华文明源远流长、博大精深，是（ ）"
  },
  {
    "id": 41,
    "question": "新发展理念是一个系统的理论体系，回答了关于发展的目的、动力、方式、路径等一系列理论和实践问题，阐明了我们党关于发展的政治立场、价值导向、发展模式、发展道路等重大政治问题。新发展理念的“根”和“魂”是(C)。",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "科技创新与科技自立自强公"
      },
      {
        "key": "B",
        "text": "高质量发展"
      },
      {
        "key": "C",
        "text": "为人民谋幸福、为民族谋复兴"
      },
      {
        "key": "D",
        "text": "以人民为中心"
      }
    ],
    "type": "single",
    "displayQuestion": "新发展理念是一个系统的理论体系，回答了关于发展的目的、动力、方式、路径等一系列理论和实践问题，阐明了我们党关于发展的政治立场、价值导向、发展模式、发展道路等重大政治问题。新发展理念的“根”和“魂”是（ ）。"
  },
  {
    "id": 42,
    "question": "习近平强军思想明确党在新时代的强军目标是建设支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成为世界一流军队。这一目标的保证是(A)。",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "作风优良"
      },
      {
        "key": "B",
        "text": "能打胜仗"
      },
      {
        "key": "C",
        "text": "听党指挥"
      },
      {
        "key": "D",
        "text": "实事求是"
      }
    ],
    "type": "single",
    "displayQuestion": "习近平强军思想明确党在新时代的强军目标是建设支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成为世界一流军队。这一目标的保证是（ ）。"
  },
  {
    "id": 43,
    "question": "中国特色社会主义最本质的特征是 (B)",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "集中力量办大事"
      },
      {
        "key": "B",
        "text": "中国共产党领导"
      },
      {
        "key": "C",
        "text": "坚持以人民为中心"
      },
      {
        "key": "D",
        "text": "促进人的全面发展"
      }
    ],
    "type": "single",
    "displayQuestion": "中国特色社会主义最本质的特征是 （ ）"
  },
  {
    "id": 44,
    "question": "习近平强军思想明确党在新时代的强军目标是建设支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成为世界一流军队。这一目标的核心是(A)。",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "能打胜仗"
      },
      {
        "key": "B",
        "text": "听党指挥"
      },
      {
        "key": "C",
        "text": "实事求是"
      },
      {
        "key": "D",
        "text": "作风优良"
      }
    ],
    "type": "single",
    "displayQuestion": "习近平强军思想明确党在新时代的强军目标是建设支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成为世界一流军队。这一目标的核心是（ ）。"
  },
  {
    "id": 45,
    "question": "十四五”规划建议中提出，我国将加快推动绿色低碳发展，制定(A)年前碳排放达到峰值的行动方案",
    "answer": "A",
    "options": [
      {
        "key": "A",
        "text": "2030"
      },
      {
        "key": "B",
        "text": "2035"
      },
      {
        "key": "C",
        "text": "2025"
      },
      {
        "key": "D",
        "text": "2050"
      }
    ],
    "type": "single",
    "displayQuestion": "十四五”规划建议中提出，我国将加快推动绿色低碳发展，制定（ ）年前碳排放达到峰值的行动方案"
  },
  {
    "id": 46,
    "question": "(D)的核心是正确处理经济发展与环境保护的关系。",
    "answer": "D",
    "options": [
      {
        "key": "A",
        "text": "循环发展"
      },
      {
        "key": "B",
        "text": "持续发展"
      },
      {
        "key": "C",
        "text": "生态发展"
      },
      {
        "key": "D",
        "text": "绿色发展"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）的核心是正确处理经济发展与环境保护的关系。"
  },
  {
    "id": 47,
    "question": "坚持党的领导、人民当家作主、依法治国有机统是中国特色社会主义民主政治的集中体现，其中，(B)是党领导人民治理国家的基本方式",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "全过程人民民主"
      },
      {
        "key": "B",
        "text": "依法治国"
      },
      {
        "key": "C",
        "text": "人民当家作主"
      },
      {
        "key": "D",
        "text": "党的领导"
      }
    ],
    "type": "single",
    "displayQuestion": "坚持党的领导、人民当家作主、依法治国有机统是中国特色社会主义民主政治的集中体现，其中，（ ）是党领导人民治理国家的基本方式"
  },
  {
    "id": 48,
    "question": "(D)是新发展理念的重要组成部分，是建设美丽中国的重要内容",
    "answer": "D",
    "options": [
      {
        "key": "A",
        "text": "创新发展"
      },
      {
        "key": "B",
        "text": "循环发展"
      },
      {
        "key": "C",
        "text": "可持续发展"
      },
      {
        "key": "D",
        "text": "绿色发展"
      }
    ],
    "type": "single",
    "displayQuestion": "（ ）是新发展理念的重要组成部分，是建设美丽中国的重要内容"
  },
  {
    "id": 49,
    "question": "我军之所以能够无往而不胜，最终战胜一切敌人而不为敌人所压倒，是因为坚决 (B)，这是我们的建军之魂、强军之魂。",
    "answer": "B",
    "options": [
      {
        "key": "A",
        "text": "勇毅前行"
      },
      {
        "key": "B",
        "text": "听党指挥"
      },
      {
        "key": "C",
        "text": "守正创新"
      },
      {
        "key": "D",
        "text": "与时俱进"
      }
    ],
    "type": "single",
    "displayQuestion": "我军之所以能够无往而不胜，最终战胜一切敌人而不为敌人所压倒，是因为坚决 （ ），这是我们的建军之魂、强军之魂。"
  },
  {
    "id": 50,
    "question": "中国将提高国家自主贡献力度，采取更加有力的政策和措施，二氧化碳排放力争于(C)年前实现碳中和。",
    "answer": "C",
    "options": [
      {
        "key": "A",
        "text": "2030"
      },
      {
        "key": "B",
        "text": "2025"
      },
      {
        "key": "C",
        "text": "2060"
      },
      {
        "key": "D",
        "text": "2050"
      }
    ],
    "type": "single",
    "displayQuestion": "中国将提高国家自主贡献力度，采取更加有力的政策和措施，二氧化碳排放力争于（ ）年前实现碳中和。"
  },
  {
    "id": 51,
    "question": "习近平新时代中国特色社会主义思想，深入探索和回答了 (ABC)等重大时代课题。",
    "answer": "ABC",
    "options": [
      {
        "key": "A",
        "text": "建设什么样的社会主义现代化强国、怎样建设社会主义现代化强国"
      },
      {
        "key": "B",
        "text": "建设什么样的长期执政的马克思主义政党、怎样建设长期执政的马克思主义政党"
      },
      {
        "key": "C",
        "text": "新时代坚持和发展什么样的中国特色社会主义、怎样坚持和发展中国特色社会主义"
      },
      {
        "key": "D",
        "text": "实现什么样的发展，怎样实现发展"
      }
    ],
    "type": "multiple",
    "displayQuestion": "习近平新时代中国特色社会主义思想，深入探索和回答了 （ ）等重大时代课题。"
  },
  {
    "id": 52,
    "question": "在以习近平同志为核心的党中央坚强领导下，中华民族正以前所未有的 (ABCD)推进中国特色社会主义事业，昂首阔步迈向民族复兴的伟大征程",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "制度自信"
      },
      {
        "key": "B",
        "text": "文化自信"
      },
      {
        "key": "C",
        "text": "理论自信"
      },
      {
        "key": "D",
        "text": "道路自信"
      }
    ],
    "type": "multiple",
    "displayQuestion": "在以习近平同志为核心的党中央坚强领导下，中华民族正以前所未有的 （ ）推进中国特色社会主义事业，昂首阔步迈向民族复兴的伟大征程"
  },
  {
    "id": 53,
    "question": "人民军队实现整体性革命性重塑，重塑组织形态后形成了 (BCD)新格局，打造以精锐作战力量为主体的军事力量体系，初步形成中国特色社会主义军事政策制度体系基本框架",
    "answer": "BCD",
    "options": [
      {
        "key": "A",
        "text": "合力共建"
      },
      {
        "key": "B",
        "text": "军种主建"
      },
      {
        "key": "C",
        "text": "战区主战"
      },
      {
        "key": "D",
        "text": "军委管总"
      }
    ],
    "type": "multiple",
    "displayQuestion": "人民军队实现整体性革命性重塑，重塑组织形态后形成了 （ ）新格局，打造以精锐作战力量为主体的军事力量体系，初步形成中国特色社会主义军事政策制度体系基本框架"
  },
  {
    "id": 54,
    "question": "我们推进的现代化，是中国共产党领导的社会主义现代化，是 (ABCD)。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "走和平发展道路的现代化"
      },
      {
        "key": "B",
        "text": "人与自然和谐共生的现代化"
      },
      {
        "key": "C",
        "text": "物质文明和精神文明相协调的现代化"
      },
      {
        "key": "D",
        "text": "人口规模巨大和全体人民共同富裕的现代化"
      }
    ],
    "type": "multiple",
    "displayQuestion": "我们推进的现代化，是中国共产党领导的社会主义现代化，是 （ ）。"
  },
  {
    "id": 55,
    "question": "党在新时代的强军目标是建设一支 (ABD)的人民军队，把人民军队建设成为世界一流军队。",
    "answer": "ABD",
    "options": [
      {
        "key": "A",
        "text": "听党指挥"
      },
      {
        "key": "B",
        "text": "作风优良"
      },
      {
        "key": "C",
        "text": "敢打敢拼"
      },
      {
        "key": "D",
        "text": "能打胜仗"
      }
    ],
    "type": "multiple",
    "displayQuestion": "党在新时代的强军目标是建设一支 （ ）的人民军队，把人民军队建设成为世界一流军队。"
  },
  {
    "id": 56,
    "question": "生态文明建设关乎人类未来，我国已成为全球生态文明建设的重要 (ACD)，主张加快构筑尊崇自然、绿色发展的生态体系，共建清洁美丽的世界",
    "answer": "ACD",
    "options": [
      {
        "key": "A",
        "text": "参与者"
      },
      {
        "key": "B",
        "text": "主导者"
      },
      {
        "key": "C",
        "text": "引领者"
      },
      {
        "key": "D",
        "text": "贡献者"
      }
    ],
    "type": "multiple",
    "displayQuestion": "生态文明建设关乎人类未来，我国已成为全球生态文明建设的重要 （ ），主张加快构筑尊崇自然、绿色发展的生态体系，共建清洁美丽的世界"
  },
  {
    "id": 57,
    "question": "绿水青山就是金山银山，是重要的发展理念，也是推进现代化建设的重大原则。这一理念阐述了(ABCD)",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "保护生态就是保护自然价值和增值自然资本的过程"
      },
      {
        "key": "B",
        "text": "保护环境就是保护经济社会发展潜力和后劲的过程"
      },
      {
        "key": "C",
        "text": "保护生态环境就是保护生产力、改善生态环境就是发展生产力"
      },
      {
        "key": "D",
        "text": "良好的生态本身就蕴含着无穷的经济价值，能够源源不断地创造综合效益，实现经济社会可持续发展"
      }
    ],
    "type": "multiple",
    "displayQuestion": "绿水青山就是金山银山，是重要的发展理念，也是推进现代化建设的重大原则。这一理念阐述了（ ）"
  },
  {
    "id": 58,
    "question": "扎实推进碳达峰碳中和工作，要注重处理好 (ABCD)关系。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "长远和短期"
      },
      {
        "key": "B",
        "text": "发展和减排"
      },
      {
        "key": "C",
        "text": "政府和市场"
      },
      {
        "key": "D",
        "text": "整体和局部"
      }
    ],
    "type": "multiple",
    "displayQuestion": "扎实推进碳达峰碳中和工作，要注重处理好 （ ）关系。"
  },
  {
    "id": 59,
    "question": "马克思主义是我们立党立国、兴党兴国的根本指导思想，要坚持把马克思主义基本原理 (AD)，用马克思主义观察时代、把握时代、引领时代，继续发展当代中国马克思主义、21世纪马克思主义。",
    "answer": "AD",
    "options": [
      {
        "key": "A",
        "text": "同中华优秀传统文化相结合"
      },
      {
        "key": "B",
        "text": "同人类优秀文明成果相结合"
      },
      {
        "key": "C",
        "text": "同社会主义先进文化相结合"
      },
      {
        "key": "D",
        "text": "同中国具体实际相结合"
      }
    ],
    "type": "multiple",
    "displayQuestion": "马克思主义是我们立党立国、兴党兴国的根本指导思想，要坚持把马克思主义基本原理 （ ），用马克思主义观察时代、把握时代、引领时代，继续发展当代中国马克思主义、21世纪马克思主义。"
  },
  {
    "id": 60,
    "question": "新时代人民军队使命任务，是为 (ABCD)提供战略支撑。",
    "answer": "ABCD",
    "options": [
      {
        "key": "A",
        "text": "维护我国海外利益"
      },
      {
        "key": "B",
        "text": "巩固中国共产党领导和我国社会主义制度"
      },
      {
        "key": "C",
        "text": "促进世界和平与发展"
      },
      {
        "key": "D",
        "text": "捍卫国家主权、统一、领土完整"
      }
    ],
    "type": "multiple",
    "displayQuestion": "新时代人民军队使命任务，是为 （ ）提供战略支撑。"
  }
];
